# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here


import pandas as pd
import sqlite3

In [2]:
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [3]:
#Your code here

cur.execute("""SELECT firstName, lastName FROM employees JOIN offices USING (officeCode) WHERE city = 'Boston';""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [10]:
#Your code here

cur.execute("""SELECT city, officeCode, COUNT(employeeNumber) as employeeCount FROM offices JOIN employees USING (officeCode) GROUP BY city;""")

df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

            city officeCode  employeeCount
0         Boston          2              2
1         London          7              2
2            NYC          3              2
3          Paris          4              5
4  San Francisco          1              6
5         Sydney          6              4
6          Tokyo          5              2

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!